autos/app/controllers/brands_controller.rb

  def index
    page = (params[:page] || 1).to_i
    per_page = (params[:per_page] || 10).to_i

    @brands = Brand.all
    total_count = @brands.count

    # Apply pagination
    @brands = @brands.offset((page - 1) * per_page).limit(per_page)

    render json: {
      brands: @brands.map { |brand| brand_json(brand) },
      meta: {
---
SELECT "brands".* FROM "brands"
SELECT COUNT(*) FROM "brands"
SELECT "brands".* FROM "brands" LIMIT 10 OFFSET 0

  def create
    @brand = Brand.new(brand_params)
    if @brand.save
---
INSERT INTO "brands" ("name", "average_price", "created_at", "updated_at") VALUES ('Prueba2', NULL, '2025-03-17 23:57:19.497112', '2025-03-17 23:57:19.497112') RETURNING "id"