autos/app/controllers/models_controller.rb

  def index
    page = (params[:page] || 1).to_i
    per_page = (params[:per_page] || 10).to_i

    if params[:brand_id]
      # GET /brands/:id/models
      @models = @brand.models
      total_count = @models.count

      # Apply pagination
      @models = @models.offset((page - 1) * per_page).limit(per_page)

      render json: {
        models: @models.map { |model| model_json(model) },
        meta: {
          current_page: page,
          per_page: per_page,
          total_count: total_count,
          total_pages: (total_count.to_f / per_page).ceil
        }
      }
    else
      # GET /models
      @models = Model.all
      @models = @models.where('average_price > ?', params[:greater]) if params[:greater].present?
      @models = @models.where('average_price < ?', params[:lower]) if params[:lower].present?

      total_count = @models.count

      # Apply pagination
      @models = @models.offset((page - 1) * per_page).limit(per_page)
---
SELECT COUNT(*) FROM "models" WHERE "models"."brand_id" = 2
SELECT "models".* FROM "models"
SELECT "models".* FROM "models" WHERE "models"."brand_id" = 2 LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "models" WHERE (average_price > '380000') AND (average_price < '400000')
SELECT "models".* FROM "models" WHERE (average_price > '380000') AND (average_price < '400000') LIMIT 10 OFFSET 0

  def create
    @model = @brand.models.new(model_params)

    if @model.save
---
INSERT INTO "models" ("name", "average_price", "brand_id", "created_at", "updated_at") VALUES ('Prius', 406400, 63, '2025-03-17 23:59:34.667051', '2025-03-17 23:59:34.667051') RETURNING "id"

  def update
    if @model.update(model_update_params)
---
UPDATE "models" SET "average_price" = 406400, "updated_at" = '2025-03-18 00:02:04.876562' WHERE "models"."id" = 2

  def set_model
    @model = Model.find_by(id: params[:id])
---
SELECT "models".* FROM "models" WHERE "models"."id" = 2 LIMIT 1

  def set_brand
    if params[:brand_id]
      @brand = Brand.find_by(id: params[:brand_id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = 2 LIMIT 1